In [ ]:
# Introucción al analisis de datos con Pandas
# EDA Analisis exploratorio de datos

# Pandas

In [2]:
import pandas as pd

In [3]:
serie1 = pd.Series(['Ecuador', 'Perú', 'Bolivia', 'Chile', 'Colombia', 'Venezuela'])
serie1

0      Ecuador
1         Perú
2      Bolivia
3        Chile
4     Colombia
5    Venezuela
dtype: object

In [5]:
serie2 = pd.Series(['Quito', 'Lima', 'La Paz', 'Santiago', 'Bogotá', 'Caracas'])
serie2

0       Quito
1        Lima
2      La Paz
3    Santiago
4      Bogotá
5     Caracas
dtype: object

In [6]:
paises_capitales = pd.DataFrame({'Paises': serie1, 'Capitales': serie2})
paises_capitales

      Paises Capitales
0    Ecuador     Quito
1       Perú      Lima
2    Bolivia    La Paz
3      Chile  Santiago
4   Colombia    Bogotá
5  Venezuela   Caracas

In [8]:
# Guardar el dataframe en un archivo csv
paises_capitales.to_csv('paises_capitales.csv',index=False)

In [9]:
data_paises_capitales = pd.read_csv('paises_capitales.csv')

# Metodos importantes Pandas

In [10]:
# Leer archivo de cars
dataCars = pd.read_csv('cars.csv')
dataCars

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
dataCars.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [12]:
# Columnas del archivo dataCars
dataCars.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [13]:
# Indice del dataframe
dataCars.index

RangeIndex(start=0, stop=10, step=1)

In [14]:
# Información del dataframe
dataCars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [49]:
# Descripción del dataframe
dataCars.describe()

       Odometer (KM)     Doors  Price
count       2.000000  2.000000    0.0
mean   122822.000000  3.500000    NaN
std    127665.300916  0.707107    NaN
min     32549.000000  3.000000    NaN
25%     77685.500000  3.250000    NaN
50%    122822.000000  3.500000    NaN
75%    167958.500000  3.750000    NaN
max    213095.000000  4.000000    NaN

In [17]:
fabricantes = dataCars.Make
fabricantes

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [37]:
# Crear un dataframe con 3 columnas
superheroes = pd.DataFrame({'Nombre': ['Superman', 'Batman', 'Spiderman', 'Flash', 'Wonderwoman'],
                         'Poder': ['Volar', 'Superfuerza', 'Apariencia', 'Velocidad', 'Supervivencia'],
                         'Debilidad': ['Miedo', 'Superfuerza', 'Apariencia', 'Velocidad', 'Supervivencia']},
                         index=['1', '2', '3', '4', '5'])
superheroes

        Nombre          Poder      Debilidad
1     Superman          Volar          Miedo
2       Batman    Superfuerza    Superfuerza
3    Spiderman     Apariencia     Apariencia
4        Flash      Velocidad      Velocidad
5  Wonderwoman  Supervivencia  Supervivencia

In [27]:
# Acceder a un elemento del dataframe
superheroes.loc['1']

Nombre       Superman
Poder           Volar
Debilidad       Miedo
Name: 1, dtype: object

In [30]:
# Acceder a un elemento del dataframe con iloc
superheroes.iloc[4]

Nombre         Wonderwoman
Poder        Supervivencia
Debilidad    Supervivencia
Name: 5, dtype: object

In [32]:
# Acceder a un conjunto de elementos del dataframe con iloc
superheroes.iloc[0:4]

      Nombre        Poder    Debilidad
1   Superman        Volar        Miedo
2     Batman  Superfuerza  Superfuerza
3  Spiderman   Apariencia   Apariencia
4      Flash    Velocidad    Velocidad

In [33]:
# Obtener datos de columnas y filas espcificas
superheroes.loc[['1', '2'], ['Nombre', 'Poder']]

     Nombre        Poder
1  Superman        Volar
2    Batman  Superfuerza

# Filtros

In [34]:
# Filtrar datos
superheroes.loc[superheroes['Nombre'] == 'Wonderwoman']

        Nombre          Poder      Debilidad
5  Wonderwoman  Supervivencia  Supervivencia

In [38]:
registros =[2,4]
dataCars.loc[registros]

     Make Colour  Odometer (KM)  Doors      Price
2  Toyota   Blue          32549      3  $7,000.00
4  Nissan  White         213095      4  $3,500.00

In [40]:
dataCars.loc[dataCars['Make'] == 'Toyota']

     Make Colour  Odometer (KM)  Doors      Price
2  Toyota   Blue          32549      3  $7,000.00

In [42]:
# Obtener odometro de los autos menor al promedio
dataCars.loc[dataCars['Odometer (KM)'] < dataCars['Odometer (KM)'].mean()]

     Make Colour  Odometer (KM)  Doors      Price
2  Toyota   Blue          32549      3  $7,000.00

In [47]:
# Transformar price a datos a numerico
dataCars['Price'] = pd.to_numeric(dataCars['Price'], errors='coerce')

In [56]:
# Ejercicio en clase: Aplicar dos filtros a los datos

# Filtrar los superhéroes que tengan el poder sea volar y la debilidad sea miedo
superheroes.loc[(superheroes['Poder'] == 'Volar') & (superheroes['Debilidad'] == 'Miedo')]

     Nombre  Poder Debilidad
1  Superman  Volar     Miedo

In [58]:
# Agrupar los datos de los autos por fabricante
dataCars.groupby('Make')